{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 32, "batch_input_shape": [null, 32, 32, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 32, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_3", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 64, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_4", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 64, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "units": 64, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "units": 10, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "class_name": "Sequential", "backend": "tensorflow"}